In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(101) #seed creation for random number

In [3]:
#randn gives a sample of normal distribution
df=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [4]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [5]:
#conditional operators can be used
#they return bool
df <0

       w      x      y      z
a  False  False  False  False
b  False   True   True  False
c   True  False  False   True
d  False   True   True  False
e  False  False  False  False

In [6]:
#can be passed to the dataframe
#NaN is replaced for all False cond
df[df<0]

          w         x         y         z
a       NaN       NaN       NaN       NaN
b       NaN -0.319318 -0.848077       NaN
c -2.018168       NaN       NaN -0.589001
d       NaN -0.758872 -0.933237       NaN
e       NaN       NaN       NaN       NaN

In [10]:
#most common case pass rows or column to the df for conditions
df[df['w']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

only that df is given where w is smaller than 0

its possible to get only column as series as below

In [11]:
df['w']<0

a    False
b    False
c     True
d    False
e    False
Name: w, dtype: bool

gives a series of bool

__grab all the rows of df where column y is less than 0__

In [12]:
#returns rows where column y is negative
df[df['y']<0]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

__?? what values does column x has where z has all negative values__

can be done in two ways

In [14]:
#creating a dataframe of z condition
res=df[df['z']<0]

In [15]:
#checking x in the result dataframe after z condition
res['x']

c    0.740122
Name: x, dtype: float64

In [16]:
#see yourself
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [18]:
#another way is to use indexing
df[df['z']<0]['x'] #df[df['z']<0] gives you another df that can be indexed for 'x'

c    0.740122
Name: x, dtype: float64

In [21]:
#can also grab multiple columns
df[df['z']<0][['x','y']]

          x         y
c  0.740122  0.528813

__multiple conditions__

In [22]:
#like below
df[(df['z']<0) and (df['y']<1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

now the error is because and can only compare two boolean values not multiple. above we have multiple booleans compared using and

In [23]:
True and True

True

In [24]:
True and False

False

In [28]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [29]:
df['z']<0

a    False
b    False
c     True
d    False
e    False
Name: z, dtype: bool

see there is a series of boolean values which results in ambiguity

In [30]:
#use & instead
df[(df['z']<0) & (df['y']<1)]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [31]:
# a pipe | for or operate
df[(df['z']<0) | (df['y']<1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

__resetting indexes__

In [33]:
#the reset index method
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

this will move the prev index to columns and give integers as new index

In [34]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

the changes are not inplace for that inplace=True needs to be given

In [35]:
states='DL UA CH HR KA'.split() #creating list out of string

In [36]:
states

['DL', 'UA', 'CH', 'HR', 'KA']

In [37]:
#adding one more column to the df
df['states']=states

In [38]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     DL
b  0.651118 -0.319318 -0.848077  0.605965     UA
c -2.018168  0.740122  0.528813 -0.589001     CH
d  0.188695 -0.758872 -0.933237  0.955057     HR
e  0.190794  1.978757  2.605967  0.683509     KA

now set_index can be used to set a column as index in a dataframe as below

In [41]:
df.set_index('states')

               w         x         y         z
states
DL      2.706850  0.628133  0.907969  0.503826
UA      0.651118 -0.319318 -0.848077  0.605965
CH     -2.018168  0.740122  0.528813 -0.589001
HR      0.188695 -0.758872 -0.933237  0.955057
KA      0.190794  1.978757  2.605967  0.683509

keep in mind set_index overwrite the previous index

In [43]:
#also the changes are not inplace unless inplace=True
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     DL
b  0.651118 -0.319318 -0.848077  0.605965     UA
c -2.018168  0.740122  0.528813 -0.589001     CH
d  0.188695 -0.758872 -0.933237  0.955057     HR
e  0.190794  1.978757  2.605967  0.683509     KA